apache/nuttx/arch/arm/src/nrf52/nrf52_qspi.c
  nrf52_gpio_config(NRF52_QSPI0_SCK_PIN | GPIO_DRIVE_H0H1);
  pin = GPIO_PIN_DECODE(NRF52_QSPI0_SCK_PIN);
  port = GPIO_PORT_DECODE(NRF52_QSPI0_SCK_PIN);
  regval = (pin << QSPI_PSEL_PIN_SHIFT) | (port << QSPI_PSEL_PORT_SHIFT);
  nrf52_qspi_putreg(priv, NRF52_QSPI_PSEL_SCK_OFFSET, regval);

  /* CSN pin */

  nrf52_gpio_config(NRF52_QSPI0_CSN_PIN | GPIO_DRIVE_H0H1);
  pin = GPIO_PIN_DECODE(NRF52_QSPI0_CSN_PIN);
  port = GPIO_PORT_DECODE(NRF52_QSPI0_CSN_PIN);
  regval = (pin << QSPI_PSEL_PIN_SHIFT) | (port << QSPI_PSEL_PORT_SHIFT);
  nrf52_qspi_putreg(priv, NRF52_QSPI_PSEL_CSN_OFFSET, regval);

  /* IO0 pin */

  nrf52_gpio_config(NRF52_QSPI0_IO0_PIN | GPIO_DRIVE_H0H1);
  pin = GPIO_PIN_DECODE(NRF52_QSPI0_IO0_PIN);
  port = GPIO_PORT_DECODE(NRF52_QSPI0_IO0_PIN);
  regval = (pin << QSPI_PSEL_PIN_SHIFT) | (port << QSPI_PSEL_PORT_SHIFT);
  nrf52_qspi_putreg(priv, NRF52_QSPI_PSEL_IO0_OFFSET, regval);

  /* IO1 pin */

  nrf52_gpio_config(NRF52_QSPI0_IO1_PIN | GPIO_DRIVE_H0H1);
  pin = GPIO_PIN_DECODE(NRF52_QSPI0_IO1_PIN);
  port = GPIO_PORT_DECODE(NRF52_QSPI0_IO1_PIN);
  regval = (pin << QSPI_PSEL_PIN_SHIFT) | (port << QSPI_PSEL_PORT_SHIFT);
  nrf52_qspi_putreg(priv, NRF52_QSPI_PSEL_IO1_OFFSET, regval);

  /* IO2 pin */

  nrf52_gpio_config(NRF52_QSPI0_IO2_PIN | GPIO_DRIVE_H0H1);
  pin = GPIO_PIN_DECODE(NRF52_QSPI0_IO2_PIN);
  port = GPIO_PORT_DECODE(NRF52_QSPI0_IO2_PIN);
  regval = (pin << QSPI_PSEL_PIN_SHIFT) | (port << QSPI_PSEL_PORT_SHIFT);
  nrf52_qspi_putreg(priv, NRF52_QSPI_PSEL_IO2_OFFSET, regval);

  /* IO3 pin */

  nrf52_gpio_config(NRF52_QSPI0_IO3_PIN | GPIO_DRIVE_H0H1);
  pin = GPIO_PIN_DECODE(NRF52_QSPI0_IO3_PIN);
  port = GPIO_PORT_DECODE(NRF52_QSPI0_IO3_PIN);
  regval = (pin << QSPI_PSEL_PIN_SHIFT) | (port << QSPI_PSEL_PORT_SHIFT);
  nrf52_qspi_putreg(priv, NRF52_QSPI_PSEL_IO3_OFFSET, regval);

  /* Configure quad data line SPI */

  regval = (QSPI_IFCONFIG0_READOC_READ4IO | QSPI_IFCONFIG0_WRITEOC_PP4IO);
  regval |= QSPI_IFCONFIG0_PPSIZE_512;
  nrf52_qspi_putreg(priv, NRF52_QSPI_IFCONFIG0_OFFSET, regval);

  /* Configure RX delay */

  nrf52_qspi_putreg(priv, NRF52_QSPI_IFTIMING_OFFSET,
                    QSPI_IFTIMING_RXDELAY(CONFIG_NRF52_QSPI_RXDELAY));

  /* Enable READY interrupt */

  nrf52_qspi_putreg(priv, NRF52_QSPI_INTENSET_OFFSET, QSPI_INT_READY);

  /* Enable QSPI interrupts */

  up_enable_irq(NRF52_IRQ_QSPI);

  /* Enable QSPI */

  nrf52_qspi_putreg(priv, NRF52_QSPI_ENABLE_OFFSET, 1);

  /* Activate QSPI */

  nrf52_qspi_putreg(priv, NRF52_QSPI_TASKS_ACTIVATE_OFFSET, 1);

  /* Wait for READY event.
   * TODO: add timeout.
   */

  nxsem_wait(&priv->op_sem);

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_qspi_initialize
 *
 * Description:
 *   Initialize the selected QSPI port in master mode
 *
 * Input Parameters:
 *   intf - Interface number(must be zero)
 *
 * Returned Value:
 *   Valid QSPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct qspi_dev_s *nrf52_qspi_initialize(int intf)
{
  struct nrf52_qspidev_s *priv = NULL;
  int                     ret  = OK;

  /* The NRF52 has only a single QSPI port */

  spiinfo("intf: %d\n", intf);
  DEBUGASSERT(intf == 0);

  /* Select the QSPI interface */

  if (intf == 0)
    {
      /* Select QSPI0 */

      priv = &g_qspi0_dev;
    }
  else
    {
      spierr("ERROR: QSPI%d not supported\n", intf);
      return NULL;
    }

  /* Has the QSPI hardware been initialized? */

  if (!priv->initialized)
    {
      /* Perform hardware initialization.  Puts the QSPI into an active
       * state.
       */

      ret = nrf52_qspi_hw_initialize(priv);
      if (ret < 0)
        {
          spierr("ERROR: Failed to initialize QSPI hardware\n");
          irq_detach(NRF52_IRQ_QSPI);
          return NULL;
        }

      /* Enable interrupts at the NVIC */

      priv->initialized = true;
    }

  return &priv->qspi;
}
